Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/redundancy/redundancy.html.txt.tmx
Source language: en
Languages: ga

source: Where you lose your job due to circumstances such as the closure of the business or a reduction in the number of staff this is known as redundancy
ga: Iomarcaíocht a thugtar ar chailleadh poist in Éirinn de bharr dhúnadh gnó nó laghdú teacht ar an bhfoireann nó a leithéid

source: Generally a redundancy situation arises if your job ceases to exist and you are not replaced
ga: De ghnáth beidh iomarcaíocht i gceist má thagann deireadh le do phost agus mura ngabhann aon duine eile d'ionad

source: The reasoning for the redundancy situation could be the financial position of the firm, lack of work, reorganisation within the firm or it may be closing down completely
ga: Cúiseanna a d'fhéadfadh a bheith le hiomarcaíocht ná staid airgeadais an ghnóthais, easpa oibre, atheagrú an ghnóthais, nó é a bheith ag dúnadh uile

source: The Redundancy Payments Acts 1967–2014 provide a minimum entitlement to a redundancy payment for employees who have a set period of service with the employer
ga: Tugann na hAchtanna um Íocaíochtaí Iomarcaíochta 1967–2014 íostheidlíocht le haghaidh íocaíochtaí iomarcaíochta do dhaoine a bhfuil tréimhse seirbhíse socraithe caite acu leis an bhfostóir

source: Not all employees are entitled to this statutory redundancy payment, even where a redundancy situation exists
ga: Ní gach fostaí a bhíonn i dteideal na híocaíochta reachtúla iomarcaíochta seo, fiú nuair atá iomarcaíocht i gceist

source: If you do qualify for redundancy there are specific redundancy procedures which employers and employees must follow in order to comply with the legislation
ga: Má tá tú incháilithe le haghaidh iomarcaíochta tá nósanna iomarcaíochta le leanúint ag fostaithe agus fostóirí chun a bheith in oiriúint leis an reachtaíocht

source: To be eligible for a redundancy payment under the Acts, you must satisfy the following requirements:
ga: Chun a bheith incháilithe le haghaidh íocaíocht iomarcaíochta de réir na nAchtanna, caithfear na riachtanais seo a leanas a shásamh:

source: • You must be aged 16 or over
ga: • Caithfidh tú a bheith 16 bliain d'aois nó níos mó

source: (Since 8 May 2007 there is no upper age limit of 66.)
ga: (Ó 8 Bealtaine 2007 chuir deireadh leis an uasteorann 66 bliain d'aois chun bheith i dteideal íocaíochtai reachtúla iomarcaíochta.)

source: • You must be in employment that is insurable under the Social Welfare Acts
ga: • Caithfidh tú a bheith i bhfostaíocht inárachais de réir na nAchtanna Leasa Shóisialaigh

source: Full-time employees under the age of 66 must be paying Class A PRSI
ga: Ní mór d'fhostaithe lánaimseartha faoi bhun aois 66 ÁSPC Aicme A a íoc

source: (This insurability requirement does not apply to part-time workers - see below.)
ga: (Níl an riachtanas inárachaitheachta i bhfeidhm maidir le hoibrithe páirtaimseartha – féach thíos)

source: • You must have worked continuously for your employer for at least 104 weeks over the age of 16
ga: • Caithfidh go raibh tú ag obair go leanúnach ar son do fhostóra le 104 seachtaine ar a laghad (2 bhliain) os cionn 16 bliain d'aois

source: • You must have been made redundant
ga: • Caithfidh go briseadh as do phost tú de bharr iomarcaíochta

source: In deciding whether you have worked continuously for your employer for at least 104 weeks (2 years), the following situations will not break the continuity of your service:
ga: Agus ag tabhairt breithe ar ar oibrigh tú go leanúnach ar son do fhostóra le 104 seachtaine ar a laghad, ní chuirfidh aon cheann de na cásanna seo isteach ar an mbreithiúnas:

source: • You were on maternity leave, paternity leave, adoptive leave, parental leave or carer's leave
ga: • Bhí tú ar saoire mháithreachais, shaoire atharthachta, shaoire uchtála, shaoire thuismitheora nó shaoire chúramóra

source: • You were off work through illness, agreed absence, holidays or lay off
ga: • Bhí tú saor ón obair de bharr tinnis, mar gheall ar neamhláithreacht réamhshocraithe, laethanta saoire, nó leagan as foirne

source: • You were dismissed due to redundancy before reaching 104 weeks' service and then taken back by your employer within 26 weeks of that dismissal
ga: • Briseadh as do p(h)ost tú de bharr iomarcaíochta sula raibh 104 seachtaine seirbhíse slánaithe agat agus athfostaíodh tú taobh istigh de 26 seachtaine ina dhiaidh

source: • You have been re-employed within 4 weeks of dismissal by an associate company of your previous employer
ga: • Athfhostaíodh tú taobh istigh d'achar ceithre seachtaine ag cuideachta chomhlachaithe de chuid do iarfhostóir

source: • You have been voluntarily transferred to another employer and it is agreed that the continuity of your service will not be broken
ga: • Rinneadh tú a aistriú chuig fostóir eile go toilteanach agus aontaíodh nach gcuirfeadh seo isteach ar leanúnachas do chuis seirbhíse

source: • You are placed back in your employment under the unfair dismissals legislation
ga: • Cuirtear ar ais thú i do chuid fostaíochta de bharr na reachtaíochta um dhífhostú éagórach

source: • You are on strike or locked out of your employment
ga: • Tá tú ar stailc nó frithdhúnta ó do chuid oibre

source: • There has been a transfer of the business you work for to a new owner
ga: • Má aistríodh an gnó lena bhfuil tú ag obair, go dtí úinéir nua

source: If you are an apprentice, the same rules apply to you and you may qualify for redundancy payment unless you are dismissed within one month after the end of your apprenticeship
ga: Más printíseach thú, tá na rialacha céanna i bhfeidhm maidir leatsa agus seans go mbeidh tusa incháilithe le haghaidh íocaíocht iomarcaíochta mura mbristear as do phost thú taobh istigh de mhí roimh an phrintíseacht a chríochnú

source: Agency employees are also protected under redundancy legislation
ga: Déanann reachtaíocht iomarcaíochta fostaithe gníomhaireachta chosaint chomh maith

source: If the employment agency pays the wages, it is responsible for paying the statutory redundancy payment
ga: Más iad an ghníomhaireacht fostaíochta a íocann an tuarastal, is iad atá freagrach as an íocaíocht reachtúil iomarcaíochta a íoc

source: The Redundancy Payments Act 2003 amended the insurability requirements for redundancy to ensure the rights of part-time workers to statutory redundancy
ga: Déanann an tAcht um Íocaíochtaí Iomarcaíochta 2003 leasú ar riachtanais inárachais iomarcaíochta chun cearta oibrithe páirtaimseatha a chinntiú um iomarcaíocht reachtúil

source: This amendment brings them into line with the Protection of Employees (Part-Time Work) Act 2001 which provides that part-time employees cannot be treated in a less favourable manner than comparable full-time employees in relation to conditions of employment
ga: De bharr an leasaithe seo tá siad anois ar aon dul le An tAcht um Chosaint Fostaithe (Obair Pháirtaimseartha) 2001 a tugann le fios nach féidir caitheamh le hoibrithe lánaimseartha níos fabhraí ná le hoibrithe páirtaimseatha maidir le coinníollacha fostaíochta

source: They must still meet the requirement for 2 years' continuous service as described above
ga: Caithfidh siad an riachtanas 2 bhliain seirbhís leanúnach a shásamh - féach an cur síos thuas

source: Dismissal must have occurred
ga: Caithfidh dífhostú a bheith i gceist

source: In order to demonstrate that dismissal must have occurred there must have been a termination of your employment, with or without notice
ga: Ionas le cinntiú gur dífhostú atá i gceist, caithfidh gur tháinig deireadh le do chuid fostaíochta, le nó gan rabhadh

source: Even if you are employed for a fixed term there is a dismissal if that term expires without being renewed under the same or a similar contract
ga: Agus tú fostaithe le haghaidh achar socraithe beidh dífhostú i gceist má thagann deireadh leis an socrú gan é a athnuachan faoin gconradh

source: There will also be a dismissal if you have terminated your contract of employment in circumstances where, due to the behaviour of your employer, your action is considered justified
ga: Beidh dífhostú i gceist freisin, má chuireann tú deireadh le do chonradh agus cúis mhaith agat de bharr iompar do fhostóra

source: This is known as constructive dismissal
ga: Dífhostú inchiallaithe a dtugtar ar seo

source: Unfair selection for redundancy
ga: Roghnú éagórach um iomarcaíocht

source: Although a redundancy situation exists, you may have grounds for complaint if the manner of your selection for redundancy was unfair
ga: Cé go bhfuil iomarcaíocht i gceist, seans go mbeidh de cheart agat gearán a dhéanamh má roghnaíodh thú go héagórach

source: In selecting a particular employee for redundancy, an employer should apply selection criteria that are reasonable and are applied in a fair manner
ga: Agus fostóir ag roghnú fostaí le hiomarcaíochta, ba chóir dó critéir roghnaithe a chuir i bhfeidhm go réasúnta agus go cothrom

source: You are entitled to bring a claim for unfair dismissal if you consider that you were unfairly selected for redundancy or consider that a genuine redundancy situation did not exist
ga: Tá tú i dteideal gearán a dhéanamh le haghaidh dífhostú éagórach má cheapann tú gur roghnaíodh go héagórach tú le haghaidh iomarcaíochta nó má cheapann tú nach raibh cás iomarcaíochta ann

source: Examples of these situations might include where the custom and practice in your workplace has been last in, first out and your selection did not follow this procedure
ga: Samplaí eile de seo ná nuair a leantar an nós 'is déanaí isteach is túisce amach' i d'ionad oibre ach nár leanadh leis i do chás-sa

source: Another example may be where your contract of employment sets out criteria for selection which were not subsequently followed
ga: Sampla eile ná nuair a leagadh critéar roghnaithe amach i gconradh fostaíochta nár leanadh leis

source: Under the unfair dismissals legislation, selection for redundancy based on certain specific grounds is considered unfair
ga: De réir na reachtaíochta um dhífhostú éagórach, meastar roghnú le haghaidh iomarcaíochta, déanta ar bhoinn áirithe a bheith éagórach

source: These include redundancy as the result of an employee's trade union activity, pregnancy or religious or political opinions
ga: San áireamh anseo tá iomarcaíocht de bharr gníomhaíochtaí ceardchumainn an fhostaí, toircheas an fhostaí nó tuairimí an fhostaí i leith an chreidimh nó na polaitíochta

source: The employment equality legislation also prohibits selection for redundancy that is based on any of the following nine grounds: gender, civil status, family status, age, disability, religious belief, race, sexual orientation or membership of the Traveller community
ga: Leis sin, cuireann an reachtaíocht ar chomhionannas fostaíochta cosc ar roghnú um iomarcaíocht ar na naoi mbonn seo a leanas: inscne, stádas sibhialta, stádas clainne, aois, míchumas, creideamh, cine, claonadh gnéasach, nó ballraíocht den Lucht Siúil

source: Your employer must give you at least 2 weeks' notice of the redundancy
ga: Ní mór do d’fhostóir 2 sheachtain d’fhógra na hiomarcaíochta a thabhairt

source: On the date of the termination of employment your employer should pay the redundancy lump sum due to you
ga: Ar dháta foirceannadh fostaíochta ní mór do d’fhostóir cnapshuim iomarcaíochta a íoc leat atá dlite duit

source: If your employer has not paid your redundancy lump sum, you should apply to your employer for it using form RP77 (pdf)
ga: Mura bhfuil do chnapshuim iomarcaíochta íoctha ag d’fhostóir, ba chóir duit iarratas ar d'fhostóir a dhéanamh ar fhoirm RP77 (pdf)

source: If your employer still refuses to pay it, you can apply to the Department of Social Protection for direct payment from the Social Insurance Fund
ga: Má dhiúltaíonn d'fhostóir don íocaíocht fós, is féidir leat iarratas a chur isteach chuig an Roinn Coimirce Sóisialaí le haghaidh íocaíochta dírí ón gCiste Árachais Shóisialaigh

source: This must be done online using form RP50
ga: Caithfear iarratas ar líne a dhéanamh agus foirm RP50 á húsáid

source: You can read more details about this in our document on redundancy procedures
ga: Tá tuilleadh faisnéise ar fáil sa doiciméad faoi nósanna imeachta iomarcaíochta

source: You can read this list of frequently asked questions about redundancy
ga: Tá liosta de cheisteanna coitianta maidir le hiomarcaíocht ann freisin

source: If you believe you have been unfairly selected for redundancy, you may make a claim of unfair dismissal under the unfair dismissals legislation (pdf). You must use the online complaint form available on workplacerelations.ie
ga: Má cheapann tú go ndearnadh roghnú éagórach um iomarcaíocht ort, tig leat éileamh a dhéanamh faoi na reachtaíocht um dhífhostú éagórach (pdf) tríd an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie

source: Note: if you make a claim for unfair dismissal, you cannot also claim redundancy. Further information Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Nóta: má chuireann tú isteach ar chúiteamh le haghaidh dífhostaithe éagóraigh ní féidir cuir isteach le haghaidh iomarcaíochta
